{
  "title": "MacBlog April Update",
  "date": "4.1.2024",
  "description": "In this update, we made a lot of changes to MacBlog, including new pages, broken page fixes, improved appearance and functionaily across all pages and posts, and more. Let's see what's new:",
  "mainarticles": {
    "count": "5",
    "sh1": "NEW LOOKS ON EACH ARTICLE!",
    "p1": "In this update, we drastically improved our appearance and functionaily across all pages so you can access different pages and information quicker than ever. There's new navigation and menus to help you navigate through MacBlog easily while having a modern design, including the addition of sidebars, table of contents, and more. This makes each article in the middle of the page, with the sidebar on the left and the table of contents on the right. Now each page is more complete to help you with everything MacWeb 📄!",
    "sh2": "NEW FEATURE: Sidebar!",
    "p2": "On the left of every article page, there's a new sidebar of related articles that you can click on to learn more about the topic. The sidebar also organizes every page into different categories that you can access easily, improving MacBlog navigation and performance a lot 📝.",
    "sh3": "NEW FEATURE: Table of Contents!",
    "p3": "Want to learn about an update or a post fast, but don't want to skim? Table of Contents have got you covered! On the right of each article page, there's a new table of contents bar that has all the links to important sections of the post, so if you're interested in a particular section in the table of contents, just click on it and it will guide you to the section so you can learn more about it easily, without scrolling through the entire article 📃!",
    "sh4": "NEW PAGES!",
    "p4": "As we plan on more projects and expanding the MacWeb empire, we also added some new project pages, renamed a couple updates and renewed their content, and update pages for more complete information and navigation across the entire MacWeb information hub, MacBlog 🗺️.",
    "sh5": "CONTENT ADDITIONS!",
    "p5": "We also added new content and information on some of the outdated old articles to keep MacBlog and your experience on it more seamless and up to date 🔧."
  },
  "others": {
    "count": "4",
    "other1": "Implemented MacWeb Sidebar (not the sidebar mentioned above) to every page.",
    "other2": "Fixed broken pages and content (there's a lot of them).",
    "other3": "Removed the search bar on the top right corner of some pages because there's no functionaily available and to unify all the pages.",
    "other4": "Removed update log pages because of new pages and structural changes."
  },
  "menulinks": {
    "count": "7",
    "menu1": "Intro",
    "menu1link": "#home",
    "menu2": "New Looks",
    "menu2link": "#sh1",
    "menu3": "New Sidebar",
    "menu3link": "#sh2",
    "menu4": "New Table of Contents",
    "menu4link": "#sh3",
    "menu5": "New Pages",
    "menu5link": "#sh4",
    "menu6": "Content Additions",
    "menu6link": "#sh5",
    "menu7": "Others",
    "menu7link": "#otherslist"
  },
  "year": "2024"
}
