{
  "title": "MacBlog July Update",
  "date": "7.1.2024",
  "description": "In this really tiny patch update, we created new pages, fixed old and outdated content, and kept your experience on MacBlog up-to-date. So let's see what we did this time:",
  "mainarticles": {
    "count": "3",
    "sh1": "New Pages",
    "p1": "With the exciting release of MacIdeas, we created new pages and updated some pages' content for this brand new app, and we also updated and created new pages for different updates across all our other apps 🆕.",
    "sh2": "Content Improvements",
    "p2": "There's still a lot of outdated, broken, and other stuff and content that need to be updated in MacBlog, so we fixed many pages, updated their content, and changed some descriptions to keep MacBlog updated and consistent.",
    "sh3": "New Update Schedule!",
    "p3": "MacBlog is your information hub for MacWeb, and it doesn't need new features or that much attention seeing that it's just an info center. Because there isn't a lot to update on MacBlog, so we'll be ditching the old monthly update schedule for MacBlog (we never did it anyway), and we'll be having random cummulative updates on an irregular interval. These kinds of updates are a bundle of stuff we did during the period to make the update have more content or changes. We'll be releasing these updates on the first day of a month, as usual, and our other apps won't be affected by this change 📅."
  },
  "others": {
    "count": "5",
    "other1": "Updated page titles and descriptions.",
    "other2": "Updated page contents.",
    "other3": "Fixed date format and other info on many pages.",
    "other4": "Fixed many old broken pages and content.",
    "other5": "Fixed and updated sidebar and menu content."
  },
  "menulinks": {
    "count": "5",
    "menu1": "Intro",
    "menu1link": "#home",
    "menu2": "New Pages",
    "menu2link": "#sh1",
    "menu3": "Content Improvements",
    "menu3link": "#sh2",
    "menu4": "Update Schedule",
    "menu4link": "#sh3",
    "menu5": "Others",
    "menu5link": "#otherslist"
  },
  "year": "2024"
}
