{
  "title": "MacLearn v.0.6 March Update",
  "date": "3.1.2024",
  "description": "Only 17 days after the huge anniversary update, MacLearn is receiving yet another update, only huger and better. This is probably the BIGGEST update that's ever been dropped for any MacWeb app! From Code Labs to new looks, from new articles to tons of new features, March update is bringing so many exciting stuff for MacLearn that's gonna help your learning experience by A TON. This update changes MacLearn so much that this article will be too long for anyone to read. So dive in if you want, or just skim through the headers. Let's go! ",
  "mainarticles": {
    "count": "12",
    "sh1": "NEW LOOKS!",
    "p1": "We're expanding MacLearn to become the best and the most resourceful online learning education platform, so we renamed it from MacCode (which only focused on coding) to MacLearn, where you can access tons of valuable resources and support for a wide variety of subjects and knowledge. We're also rolling out massive user interface changes, user experience updates, and a new logo for this anniversary rebranding 📖! ",
    "sh2": "INTRODUCING: QUIZ 2.0!",
    "p2": "We basically recreated the whole app in this massive update, because we're giving out massive changes to existing courses (HTML and Refrences) and releasing tons of new courses, articles, and resources for almost any subject in the future! In the next couple updates, we're gonna be publishing the CSS and JavaScript courses, so stay tuned 🆕!",
    "sh3": "NEW FEATURE: CODE LAB!",
    "p3": "From the old Coding Place to the new MacLearn, there's a lot of information that needed to be updated and rewritten, plus even more updates for functionality and appearance changes. We rewrote every article and also published some new ones, so you can learn and master a course more easily! On top of that, we're also introducing new quizzes and exercises for you practice in this update ✏️! ",
    "sh4": "NEW FEATURE: CODE SNIPPET!",
    "p4": "In order to give you the easiest, quickest, and most effective way to learn different subjects, we're rolling out a brand new powerful navigation bar on top of each pages! It has many dropdown menus for course catagories and a help menu, and when you hover over them, a list of subjects and courses will appear, and you can navigate to any course you want easily just by clicking on it! This makes all the courses organized while being easily accessible at the same time! We also added new styles, effects, and links to align MacLearn to MacWeb Site Material 2 so it feels the same as other MacWeb apps 🔥! ",
    "sh5": "NEW FEATURE: TOP BAR",
    "p5": "To make MacLearn more user friendly, modern, and unified with other MacWeb apps and match with MacWeb Site Material 2, we revamped the whole layout, content, and styling for every single page to enhance your experience on MacLearn! With carefully designed pages, you'll have a better and more comfortable learning experience 🎨! ",
    "sh6": "NEW FEATURE: SAVE!",
    "p6": "What's the point of learning to code if you can't try it out on your own? That's why we're releasing our brand new in-app online code editor Playground in this update, so you can try out your coding skills, practice, and be a master of programming! Currently, you can code in HTML, CSS, and JavaScript in Playground, and more languages will be supported in Playground soon 🧑‍💻!",
    "sh7": "NEW FEATURE: SHARE!",
    "p7": "Just like all the other MacWeb apps, MacLearn will also receive regular updates monthly, with new contents, resources, articles, pages, features, and more releasing on the first day of each month! Because of regular updates, soon, MacLearn will have tons of new courses, resources, and features 📆!",
    "sh8": "NEW FEATURE: REPORT!",
    "p8": "From this anniversary update to the version 1.0 release, we'll continue rolling out awesome features, tutorials, and more. The primary focus we'll be working on is the learning path. We'll add more exercises and quizzes for learners to test their skills, and by doing that, they'll remember more and master courses more easily. We'll also make the learning process fun by adding game elements and more to help with your learning journey. Onward ✈️!",
    "sh9": "REWRITTEN PAGES!",
    "p9": "From this anniversary update to the version 1.0 release, we'll continue rolling out awesome features, tutorials, and more. The primary focus we'll be working on is the learning path. We'll add more exercises and quizzes for learners to test their skills, and by doing that, they'll remember more and master courses more easily. We'll also make the learning process fun by adding game elements and more to help with your learning journey. Onward ✈️!",
    "sh10": "NEW COURSE HOMEPAGE!",
    "p10": "From this anniversary update to the version 1.0 release, we'll continue rolling out awesome features, tutorials, and more. The primary focus we'll be working on is the learning path. We'll add more exercises and quizzes for learners to test their skills, and by doing that, they'll remember more and master courses more easily. We'll also make the learning process fun by adding game elements and more to help with your learning journey. Onward ✈️!",
    "sh11": "NEW COURSE NAVIGATION!",
    "p11": "From this anniversary update to the version 1.0 release, we'll continue rolling out awesome features, tutorials, and more. The primary focus we'll be working on is the learning path. We'll add more exercises and quizzes for learners to test their skills, and by doing that, they'll remember more and master courses more easily. We'll also make the learning process fun by adding game elements and more to help with your learning journey. Onward ✈️!",
    "sh12": "NEW TAB: ME!",
    "p12": "From this anniversary update to the version 1.0 release, we'll continue rolling out awesome features, tutorials, and more. The primary focus we'll be working on is the learning path. We'll add more exercises and quizzes for learners to test their skills, and by doing that, they'll remember more and master courses more easily. We'll also make the learning process fun by adding game elements and more to help with your learning journey. Onward ✈️!"
  },
  "others": {
    "count": "7",
    "other1": "Fixed article dates to American format.",
    "other2": "Fixed outdated contents and improved optimization on each page.",
    "other3": "Fixed appearance bugs and problems.",
    "other4": "Fixed Refrences and other pages navigational problems and bugs.",
    "other5": "Fixed footer date and related information.",
    "other6": "Removed About page and moved it to MacBlog, MacWeb's info hub.",
    "other7": "Removed initial release date of the article, only the updated date is displayed."
  },
  "menulinks": {
    "count": "14",
    "menu1": "Intro",
    "menu1link": "#home",
    "menu2": "New Looks",
    "menu2link": "#sh1",
    "menu3": "Quiz 2.0",
    "menu3link": "#sh2",
    "menu4": "Code Lab",
    "menu4link": "#sh3",
    "menu5": "Code Snippet",
    "menu5link": "#sh4",
    "menu6": "Top Bar",
    "menu6link": "#sh5",
    "menu7": "New Feature: Save",
    "menu7link": "#sh6",
    "menu8": "New Feature: Share",
    "menu8link": "#sh7",
    "menu9": "New Feature: Report",
    "menu9link": "#sh8",
    "menu10": "Rewritten Pages",
    "menu10link": "#sh9",
    "menu11": "New Homepage",
    "menu11link": "#sh10",
    "menu12": "New Navigation",
    "menu12link": "#sh11",
    "menu13": "New Tab: Me",
    "menu13link": "#sh12",
    "menu14": "Others",
    "menu14link": "#otherslist"
  },
  "year": "2024"
}
