{
  "title": "MacVG December Update",
  "date": "12.1.2023",
  "description": "Wow, what a big update the December update is! With the 30 new games added, 7 new features, and more! It's very exciting to share them all with you! The most exciting part about the future of MacVG must be the Themes we're adding to the updates to come and the website will be more personilized and liked than ever! Thank you for checking out this update note and all the feature descriptions, and let's get right into it!",
  "mainarticles": {
    "count": "7",
    "sh1": "NEW FEATURE: Panic Button!",
    "p1": "You can now set a custom panic button or a combination which you would press when a teacher comes near, so you can quickly redirect to another site without them noticing that you were playing games! This works universally on the site. For more info, check here⚡!",
    "sh2": "NEW FEATURE: Movable Tool Bar!",
    "p2": "Sometimes the Tool Bar gets in the way of an important button for the game. That's why we made the Tool Bar movable so you can move the Tool Bar around to play the game without inconvenience, but also using the convenient Tool Bar features ✅!",
    "sh3": "NEW FEATURE: Game Information!",
    "p3": "Don't know how to play a game or want more detailed descriptions? No worries! Just click the \"i\" icon at the bottom of the tool bar for a popup window that tells you how to play the game and other related information! The report bug button is also moved into the window with a brand new modern design 📢!",
    "sh4": "NEW FEATURE: Share Game!",
    "p4": "Want to spread the fun to your friends? No problemo! You can now press the share button on the Tool Bar to copy the game link and put it anywhere to share the game with others 📨!",
    "sh5": "NEW FEATURE: Uncloak!",
    "p5": "Now you can change the website back to its original beautiful MacVG favicon and title if you don't want to use the cloaking feature anymore ⌨️!",
    "sh6": "NEW 30+ GAMES!",
    "p6": "Check them all out in the New Tab and play the newest games added to MacVG 🆕!",
    "sh7": "NEW THEME: The Holidays!",
    "p7": "A brand new feature is coming to MacVG - Themes! With awesome backgrounds, styles, and even customized logos, you can now enjoy playing unblocked games while enjoying different themes 🎄!"
  },
  "others": {
    "count": "3",
    "other1": "Minor page layout, button, and tool bar visual appearance changes and updates.",
    "other2": "Fixed Custom Cloaker not working, cloaker settings not working, and Favorites not working.",
    "other3": "Removed 2 games for maintainance and crashing issues."
  },
  "menulinks": {
    "count": "9",
    "menu1": "Intro",
    "menu1link": "#home",
    "menu2": "Panic Button",
    "menu2link": "#sh1",
    "menu3": "Movable Tool Bar",
    "menu3link": "#sh2",
    "menu4": "Game Information",
    "menu4link": "#sh3",
    "menu5": "Share Game",
    "menu5link": "#sh4",
    "menu6": "Uncloak",
    "menu6link": "#sh5",
    "menu7": "New 30+ Games",
    "menu7link": "#sh6",
    "menu8": "New Theme",
    "menu8link": "#sh7",
    "menu9": "Others",
    "menu9link": "#otherslist"
  },
  "year": "2024"
}
