{
  "title": "MacVG Prerelease Update Log",
  "date": "6.10.2023 ~ 7.21.2023",
  "description": "Here are the logs for MacVG updates before version 1.0 official release in October. Since this was before release, all the updates aren't very detailed so just note that. Here are the prerelease update logs:",
  "mainarticles": {
    "count": "7",
    "sh1": "v0.13 | 7/21/23",
    "p1": "Added the About section on the More page, updated the Settings section on the More page,overall performance improvements, and fixed some issues and bugs.",
    "sh2": "v0.12 | 7/18/23",
    "p2": "Added the Featured catagory and games, added a game (Moon Phases), added footer on each page, updated the Settings and Other Apps sections on the More page, updated appearance, and fixed some issues and bugs.",
    "sh3": "v0.11 | 7/10/23",
    "p3": "Added the Tab Cloaker feature, added breif introductions on each catagory page, updated appearance, updated Settings section on the More page, and fixed some issues and bugs.",
    "sh4": "v0.10 | 7/5/23",
    "p4": "Edited and catagorized every game into the action, strategy, sports, and casual games catagories, added the Other Apps section on the More page, updated appearance, fixed issues and bugs, and overall improvements update.",
    "sh5": "v0.8 | 6/20/23",
    "p5": "Added the Seach Games feature, added the action, strategy, sports, and casual games catagories, updated 131 games on styling, improvements, and thumbnails, updated appearance, fixed many bugs and errors, and overall improvements update.",
    "sh6": "v0.7 | 6/17/23",
    "p6": "Added feedback feature on Home and More pages, updated 80 games on styling and improvements, updated 140 games on thumbnails, updated 30 games on in-game improvements, updated home page on styling and improvements, updated appearance, fixed many bugs and errors, and deleted the files, pages, and directories from the forked version of railingames.github.io.",
    "sh7": "v0.6 | 6/10/23",
    "p7": "In the first update (creation) of MacVG, we forked the main branch of 75kh0.github.io, website created by 3kh0, Echo the Coder, added all 281 games from 3kh0, uploaded new pages, codes, and files pre-made by me, added the update log, updated website structure, pages, files, and appearance, updated 70 games on styling and improvements, updated 10 games on thumbnails, published the website, and deleted the unnecessary files, pages and directories, 503 in total."
  },
  "others": {
    "count": "1",
    "other1": "Renamed the website to TonyMac129."
  },
  "menulinks": {
    "count": "9",
    "menu1": "Intro",
    "menu1link": "#home",
    "menu2": "7.21.2023",
    "menu2link": "#sh1",
    "menu3": "7.18.2023",
    "menu3link": "#sh2",
    "menu4": "7.10.2023",
    "menu4link": "#sh3",
    "menu5": "7.5.2023",
    "menu5link": "#sh4",
    "menu6": "6.20.2023",
    "menu6link": "#sh5",
    "menu7": "6.17.2023",
    "menu7link": "#sh6",
    "menu8": "6.10.2023",
    "menu8link": "#sh7",
    "menu9": "Others",
    "menu9link": "#otherslist"
  },
  "year": "2024"
}
