{
  "title": "MacVG v.1.0 Update",
  "date": "10.13.2023",
  "description": "WOAH!!! FINALLY! Ladies and gentlemen, we are introducing: MacVG Stable Version 1.0! The first official stable version of MacVG! This is a HUGE update on everything MacVG! From the name of the website, to newly optimized games, we really changed and refreshed the game site in this remarkable update milestone! Thanks to all you, we are able to continue publish new feautres, changes, and more to MacVG in the past months and we are now ready for version 1.0. EVERYONE, HERE IT IS!",
  "mainarticles": {
    "count": "6",
    "sh1": "WEBSITE REBRANDING",
    "p1": "This is definitely the biggest update item in MacVG ever! We renamed the unblocked game site to MacVG, where the VG stands for video games, and the Mac is the prefix for every app from MacVG's parent company, MacWeb. Because of the founding of MacWeb, we refreshed every single app with new looks, new names, with brand new features and content! Other than the new name, we also applied new appearance, organizations, and changes to unify with other MacWeb apps!",
    "sh2": "NEWLY OPTIMIZED GAMES",
    "p2": "Newly optimized games with fixed content, title, appearance, and performance so you can enjoy and play them on MacVG more smoothly than ever without lagging or any issues 😎!",
    "sh3": "NEW CLOAKER",
    "p3": "Other than just renaming the title of the page in the browser, the Cloaker can also change the logo, and even change the page title to your desired cloaking website ⚙️!",
    "sh4": "NEW WEBSITE APPEARANCE",
    "p4": "New and more modern navigation bar and games interactive experience 🆕!",
    "sh5": "NEW PAGE: Updates!",
    "p5": "Added Updates page for more detailed update release notes for updates after the version 1.0 launch 📕!",
    "sh6": "NEW FEATURES COMING SOON",
    "p6": "Favorites and Download are releasing in November! You will be able to favorite games and access them quicker and download games for offline use! Other than those two, we still have A LOT features to release, so be hold 😲!"
  },
  "others": {
    "count": "7",
    "other1": "Briefly removed MacVG from GitHub for HUGE maintainance and organization purposes.",
    "other2": "Improved UI and UX: More functionality and better visuals.",
    "other3": "Fixed a lot of games that weren't working or crashing.",
    "other4": "Fixed many games lagging and glitching issues.",
    "other5": "Fixed game thumbnails/links not working.",
    "other6": "New page navigations and content on each page.",
    "other7": "Removed 25 games for maintainance and optimization."
  },
  "menulinks": {
    "count": "8",
    "menu1": "Intro",
    "menu1link": "#home",
    "menu2": "Website Rebranding",
    "menu2link": "#sh1",
    "menu3": "Optimized Games",
    "menu3link": "#sh2",
    "menu4": "New Cloaker",
    "menu4link": "#sh3",
    "menu5": "New Appearance",
    "menu5link": "#sh4",
    "menu6": "New Page",
    "menu6link": "#sh5",
    "menu7": "Features Coming",
    "menu7link": "#sh6",
    "menu8": "Others",
    "menu8link": "#otherslist"
  },
  "year": "2024"
}
