{
  "title": "MacWeb Prerelease Updates",
  "date": "4.13.2023 ~ 11.6.2023",
  "description": "All right, I'm just warning you here that this is very weird. I (this was back when this company was single-membered) didn't do a very good job recording down at exactly what date I did what, so some of these could be the wrong dates, and I'm not even sure the actual release date of MacWeb??? (probably 9.17.2023) And there's also logs that happened after the release and whatever garbage? Sorry, this is just too confusing, so here is the very messy update log:",
  "mainarticles": {
    "count": "13",
    "sh1": "4.13.2023",
    "p1": "I started my isolated Portfolio website on Replit, put my projects in it, and published it on Replit.",
    "sh2": "6.15.2023",
    "p2": "I created MacVG (previously TonyMac129) with 286 games, lots of features, and more.",
    "sh3": "9.6.2023",
    "p3": "I gave my portfolio a small revamp.",
    "sh4": "9.13.2023",
    "p4": "I renamed TonyMac129 to MacVG and had the idea to merge all my websites and projects into a big personal website (what you're looking at right now) so it's easier to organize files and stuff.",
    "sh5": "9.16.2023",
    "p5": "Planned on what the website looks like; decided to put all my projects, webpages, websites, coding files, portfolio, and more in it; and changed GitHub username.",
    "sh6": "9.17.2023",
    "p6": "Created MacWeb website; the basic structure of the website; organized MacVG, Portfolio, and all related files, folders, webpages, and materials into the website; created the home page; the about page; linked webpages to MacWeb; created the UI design; the logo; and published the website to GitHub.",
    "sh7": "9.19.2023",
    "p7": "Updated the broken UI and content for the \"Coding\" page in MacWeb Portfolio, the nav bar user effect, and fixed pages connection errors. ",
    "sh8": "9.22.2023",
    "p8": "Completed & further improved the content in the \"Coding\" page in MacWeb Portfolio, the nav bar revamp and UI updates on the older pages, structure reorganization, new Portfolio logo, new pages and updates projects in portfolio, and error fixes. ",
    "sh9": "10.9.2023 ~ 10.22.2023",
    "p9": "Moved MacWeb portfolio to an isolated website and gave it a revamp (again), planned about apps to make, app tree, organized the whole company, hired new members, organized apps and stuff, and uploaded a lot of new things, making the future roadmap for MacWeb clearer.",
    "sh10": "10.17.2023",
    "p10": "Acquired Coding Place into MacWeb company for free (it was my old project) as MacCode and did some file organization, app tree improvements, and appearance changes.",
    "sh11": "10.23.2023",
    "p11": "Acquired Ify for free (it was my older project, too) into MacWeb company as MacWork and did some file organization, app tree improvements, and appearance changes.",
    "sh12": "10.27.2023",
    "p12": "Reorganized apps and home page, and added the Blogs page for MacWeb.",
    "sh13": "11.6.2023",
    "p13": "Started working on MacWork. (will release soon!!!hopefully)"
  },
  "others": {
    "count": "1",
    "other1": "Isolated my portfolio into another seperate website that's completely seprated from MacWeb."
  },
  "menulinks": {
    "count": "15",
    "menu1": "Intro",
    "menu1link": "#home",
    "menu2": "4.13.2023",
    "menu2link": "#sh1",
    "menu3": "6.15.2023",
    "menu3link": "#sh2",
    "menu4": "9.6.2023",
    "menu4link": "#sh3",
    "menu5": "9.13.2023",
    "menu5link": "#sh4",
    "menu6": "9.16.2023",
    "menu6link": "#sh5",
    "menu7": "9.17.2023",
    "menu7link": "#sh6",
    "menu8": "9.19.2023",
    "menu8link": "#sh7",
    "menu9": "9.22.2023",
    "menu9link": "#sh8",
    "menu10": "10.9.2023 ~ 10.22.2023",
    "menu10link": "#sh9",
    "menu11": "10.17.2023",
    "menu11link": "#sh10",
    "menu12": "10.23.2023",
    "menu12link": "#sh11",
    "menu13": "10.27.2023",
    "menu13link": "#sh12",
    "menu14": "11.6.2023",
    "menu14link": "#sh13",
    "menu15": "Others",
    "menu15link": "#otherslist"
  },
  "year": "2024"
}
