{
  "title": "MacVG Version 2.5 April Update",
  "date": "4.1.2024",
  "description": "In this big update, we released a bunch of new features and fixed a lot of old ones to help make your gaming experience simpler and better, with a ton of new customization. With this update, MacVG is becoming more stable due to reworks and bug fixes and it's becoming one of the most feature-rich game sites out there! Let's see what we did and fixed:",
  "mainarticles": {
    "count": "5",
    "sh1": "DOWNLOAD REWORK",
    "p1": "Let's be honest, the old Download was really bad. When you clicked on the button, it redirected you to a Google Form to fill out your download request, and 80% of the games don't work when you download them. This was very inefficient, slow, and annoying. That's why we completed removed the Download button on games that don't work when you download them, and for the 80 games that do work, when you click on the Download button, it's gonna download the game folder immediately, and you can simply unzip the folder and start playing the game offline, which makes downloading games much more efficient, faster, and we also don't need to process that many requests. Enjoy the new Download 📁!",
    "sh2": "SETTINGS REWORK",
    "p2": "In this rework, we fixed almost every Settings option. First, we added an input field for the link of your desired tab favicon icon, so not only can you customize the tab's name, you can also customize the tab's icon, making it even harder for teachers to catch you. Second, we fixed the panic button settings, so that you can only enter one panic button instead of a combination, because of glitches and inefficiency. Third, we fixed the glitch where if you click on a setting, the page refreshes. Finally, we added the https:// prefix before the URL inputs, so it's easier for you to enter the URL in the Settings. We also fixed some other minor glitches and appearance issues on the Settings page ⚙️.",
    "sh3": "CUSTOM THEME!",
    "p3": "This is one of the most exciting feature drops we've had on MacVG. You can now create your own themes to your likings! How cool is that? Not only can you enjoy your favorite games with your favorite colors, you can also customize MacVG! To create your own theme, go to the Settings tab, navigate to the themes section, click on custom, set your main color (background) and your accent color, then click on any other place on the page, and you can see your own theme! If you don't like it, simply click on the custom button again, and change your colors so it's the perfect theme for you (btw light mode for custom themes isn't yet supported, so we'll work on that). Don't worry, it saves everytime you modify it, so have fun building your custom theme 🎨!",
    "sh4": "VISUAL ENHANCEMENTS",
    "p4": "You may have already noticed the gradient glowing title on each page that changes colors. This creates a cool neon effect that matches with gaming perfectly. Hint: glowing title works best with Deep Dark or darker themes! We also tweaked the styles for the game page a little bit so it works well with all the different themes, including custom themes! Other than that, we released a new cyberpunk gaming theme and fixed some styling transitions, bugs, and issues. Also, there's a \"New\" icon next to new features so it's more recognizable and you can try the new feature out 🆕!",
    "sh5": "NEW FEATURE: About:blank Embedder!",
    "p5": "This is a really awesome new feature in the Settings tab we're announcing in this update. There's a new section where you can type in the URL of the website that you want to open in an about:blank tab! So...why do you want to use it? Well, everything you do and every website you go to using the about:blank embedder will NOT show up in your browsing history! Now, you can game or do *other stuff* without it showing up in your history! The link also doesn't show up if you open the site in about:blank. If you want to game on MacVG without the teachers noticing, this is the way to go 🔥! (Note that this isn't a proxy)"
  },
  "others": {
    "count": "7",
    "other1": "Added data analytics on each game page for data analytics.",
    "other2": "Fixed broken links and features.",
    "other3": "The update announcement banner is now only on the homepage.",
    "other4": "Minor appearance updates.",
    "other5": "Removed some appearance bugs and animations.",
    "other6": "New descriptions and information on several games for more info-rich experience.",
    "other7": "Updated tool bar appearance because of new features and Download Rework."
  },
  "menulinks": {
    "count": "7",
    "menu1": "Intro",
    "menu1link": "#home",
    "menu2": "Download Rework",
    "menu2link": "#sh1",
    "menu3": "Settings Rework",
    "menu3link": "#sh2",
    "menu4": "Custom Theme",
    "menu4link": "#sh3",
    "menu5": "Visual Enhancements",
    "menu5link": "#sh4",
    "menu6": "About:blank Embedder",
    "menu6link": "#sh5",
    "menu7": "Others",
    "menu7link": "#otherslist"
  },
  "year": "2024"
}
