{
  "title": "MacVG Version 2.12 August Update",
  "date": "8.1.2024",
  "description": "August is the second month of summer break, and school is literally just a couple weeks away. As you prepare to go back to school, we're releasing a bunch of new games, features, and more on MacVG we hope you'll enjoy! Here's what's new in the August update:",
  "mainarticles": {
    "count": "4",
    "sh1": "NEW MACVG ORIGINAL: Atomic Survival!",
    "p1": "We're very excited to announce that we've released a new MacVG original game (other than the soundboard MacBoard), called Atomic Survival! In this game, you need to gather atoms to generate energy in a world where matter is no longer stable. Then use the energy to unlock and buy different upgrades that boost your energy generation even more! Even better, energy still keeps generating while idle, so you can make progress by not even playing the game! We'll keep updating the game to add more upgrades, chellenges, and fun! Go to the Originals tab to check out Atomic Survival now ⚛️!",
    "sh2": "NEW FEATURE: Sort & Filter!",
    "p2": "The whole point of game sites is to provide games for you to browse, play, and have a good time with to enjoy and relax. What's better to achieve this than being able to sort and filter all of MacVG's games to browse the games you like easily? With the new Sort & Filter feature right on the home page, you can choose a category you'd like to filter, and browse the games in the category you want! Or you can sort and organize the games in a certain way to view all of them with a different order. This feature adds even more freedom and ease to browsing and searching the large collections of games on MacVG, and we'll add more options in the future 🔍!",
    "sh3": "10 NEW GAMES!",
    "p3": "In this relatively small update, we added 10 new interesting games from different categories and genres that we hope you'll like! Simply go to the New tab and check the newly optimized games out! Maybe you'll find your new favorite game there 🎮!",
    "sh4": "SITE IMPROVEMENTS",
    "p4": "In this update, we fixed a couple small bugs from the game iframe layout and the Side Search feature. We also updated some of the games' titles and thumbnails to keep them up to date, easier to browse, and relevant to the game. We also updated different tabs' and pages' content because of new game arrivals and to optimize for the new Sort & Filter feature. Enjoy the faster and cleaner MacVG 🛠️!"
  },
  "others": {
    "count": "6",
    "other1": "New search bar placeholder.",
    "other2": "New default game sorting order on the homepage.",
    "other3": "Added total game count and category game count.",
    "other4": "Fixed small iframe typing issues.",
    "other5": "Minor bug fixes.",
    "other6": "Minor appearance updates."
  },
  "menulinks": {
    "count": "6",
    "menu1": "Intro",
    "menu1link": "#home",
    "menu2": "Atomic Survival",
    "menu2link": "#sh1",
    "menu3": "Sort & Filter",
    "menu3link": "#sh2",
    "menu4": "10 New Games",
    "menu4link": "#sh3",
    "menu5": "Site Improvements",
    "menu5link": "#sh4",
    "menu6": "Others",
    "menu6link": "#otherslist"
  },
  "year": "2024"
}
