{
  "title": "MacVG Version 2.1 February Update",
  "date": "2.1.2024",
  "description": "Hope you all's new year's going well so far. Following our past updates, we accidentally released an update with way more features, again. New tabs, new features, new looks, goodbye Chat... we can't list them all in one paragraph. So let's dig in and see what's new!",
  "mainarticles": {
    "count": "6",
    "sh1": "NEW FEATURE: Recent Games!",
    "p1": "Played a game on MacVG that's fun, but can't remember the name? No worries! From now on, all the games you've every played on MacVG are listed here, ordered by played date! Now you can access what you were previously playing in ease 🕒!",
    "sh2": "NEW TAB: Originals!",
    "p2": "This is one of the most exciting new features we're announcing in this update! The MacVG development team is starting to create our own original games for you to enjoy! Currently, there's only MacBoard available, with Cosmic Clicker coming in the March Update. Stay tuned for more awesome orignal games from us 🕹️!",
    "sh3": "NEW COLLAPSIBLE MENUS!",
    "p3": "With the success of the release of the Catagories Menu last update, we're refreshing and adding new collapsible menus to the navigation bar! We gave the existing Catagories Menu a refreshed modern look, and we also added a new Help Menu for MacVG support, updates, documentation, about, and feedback! We're also rolling out the Help Menu on other MacWeb apps in the future, so you can have more support using our apps 💁‍♂️!",
    "sh4": "NEW SIDEBAR!",
    "p4": "We just announced the release of MacWeb Site Material 2, and we're adding a sidebar to each MacVG page for easier navigation betweent all MacWeb apps! Simply move your mouse to the left edge of the screen, and a small sidebar will pop up, providing convenient navigation to other MacWeb apps in one click! To hide it, just click on any other place on the screen 🆕!",
    "sh5": "NEW LOGO! (kind of)",
    "p5": "Following the release of MacWeb's Site Material 2, we're giving each of our apps, including MacVG, a new logo for the navigation bar and other uses. This makes the apps more distinct from each other, and it also gives the app a unique modern feel 🖌️!",
    "sh6": "25 NEW GAMES!",
    "p6": "25 new games are here at MacVG! Our main goal of recent updates is to make the game site into the most feature-rich game site ever, and we're very closed to reaching that goal. Because of that, we have more time to add new games to the site, so we added 25 new games for MacVG to have exactly 300 games! We'll bring more and more games and features to MacVG in the future updates, so stay put 🆕!"
  },
  "others": {
    "count": "9",
    "other1": "Removed the Chat Tab because of inappropriate uses and abuse.",
    "other2": "New and more modern update announcement message.",
    "other3": "Fixed outdated contents and improved optimization on each page.",
    "other4": "Fixed MacBoard navigation problems and added 1 new sound.",
    "other5": "Fixed bugs and flaws including page keeps scrolling down when pressing space bar and Favorites not showing games.",
    "other6": "New animation effect when clicking on game tiles.",
    "other7": "Minor visual appearance changes and updates.",
    "other8": "Updated different catagories because of new games and organization.",
    "other9": "Added the YouTube link at the footer."
  },
  "menulinks": {
    "count": "8",
    "menu1": "Intro",
    "menu1link": "#home",
    "menu2": "Recent Games",
    "menu2link": "#sh1",
    "menu3": "New Tab: Originals",
    "menu3link": "#sh2",
    "menu4": "New Menus",
    "menu4link": "#sh3",
    "menu5": "New Sidebar",
    "menu5link": "#sh4",
    "menu6": "New Logo",
    "menu6link": "#sh5",
    "menu7": "25 New Games",
    "menu7link": "#sh6",
    "menu8": "Others",
    "menu8link": "#otherslist"
  },
  "year": "2024"
}
