{
  "title": "MacVG Version 2.0 January Update",
  "date": "1.1.2024",
  "description": "Happy New Year! New Year is the new beginning of everything. It's the start of an awesome year 2024, the beginning of a new change, and also, the new beginning of MacVG. Because it's the New Year, MacVG is now updated to version 2.0! A brand new and revamped version of MacVG is here with the massive January Update. From a brand new look for each game page, to new tabs, features, and more, this update is the most exiciting to share with you so far, so let's see what's new with the New Year!",
  "mainarticles": {
    "count": "11",
    "sh1": "NEW GAME PAGE LAYOUT",
    "p1": "This is probably the biggest change on MacVG ever! Now, you will see a more information-rich game page when you select a game to play! You can enjoy the game however you want on the top left game player, and if you scroll down, you can see even more in-depth info about the game, similar games, and featured games! We removed the floating Tool Bar and changed it to a horizontal bar at the bottom of the game player with a bunch of useful new buttons, so it won't cover any content but also serves its purpose well! Other than that, there's still so much more to the new game page layout, so go check it out yourself 🕹️!",
    "sh2": "NEW TAB: New!",
    "p2": "Don't want to miss any new games added to MacVG and you want to play them all? Don't worry! Just click on the New Tab on the navigational bar on the top, and you can see all the exiciting new games added in this update 🆕!",
    "sh3": "NEW TAB: Trending!",
    "p3": "If you want to play the games everybody's playing, just click on the Trending Tab and see what games are the most played in the previous week so you can also join the trend! We sort the top 10 games by how many times the game was clicked in the past 7 days 🔥!",
    "sh4": "NEW TAB: Chat!",
    "p4": "Have fun enjoying a really good game but you only have it to yourself? That's what the new Chat Tab is for! You can now chat with people from around the world in real-time and share your gaming experience with others, or you can also just chat whatever you want 🗣️!",
    "sh5": "NEW TAB: Groups!",
    "p5": "WOW! How many new features and updates are in this update?! A TON! In the new Groups Tab, you can see collections of similar games or game series so you can play them all! We'll keep adding different groups for you to explore new games that you never knew about! Even more exciting, you will be able to create game groups yourself for better game orginization in the future 📁!",
    "sh6": "NEW TAB: MacBoard!",
    "p6": "Because of the new Collapsible Catagories Menu and some other navigational changes, we added MacWeb's own soundboard MacBoard to the navigational bar so you can have fun playing the funny sounds directly from the MacBoard Tab, and we also added more sounds in this update, making it a 200-sound rich soundboard 🔊!",
    "sh7": "NEW FEATURE: Themes!",
    "p7": "One more exciting feature is here with the 2.0 update, Themes! Now you can choose between dark and light themes for a personalized gaming experience! This feature made MacVG's accessibility better and everyone can use it however they want! While gaming and having fun is good, but having a customized website is even better, so because of that, we will continue to release new themes for more choices 🖌️!",
    "sh8": "NEW COLLAPSIBLE CATAGORIES MENU!",
    "p8": "Because of so many new tabs and features, the navigational bar can't fit in so many tabs, so we grouped all the Catagory Tabs together into the collapsible menu on the top right corner of the screen. It saves a lot of space while also keeping the Catagory Tabs. Simpy hover over the Catagories Button and you will see a list of Catagories pop up, from there, you can choose your own catagory of games to play 🎲!",
    "sh9": "8 NEW GAMES!",
    "p9": "Only 8? We know what you're thinking. Yep, only 8 games are released in this update. We spent so much time working on the new game page layout, new tabs, new features, that we didn't have a lot of time to add more unblocked free games for you awesome players. But trust us, we're first focusing on the quality, features, and functionality of the website, and then we're gonna add a whole lot more games to the game library 8️⃣!",
    "sh10": "Renamed More Tab to Settings!",
    "p10": "We moved the About section of the original More Tab to MacBlog, where you can access every app's related information and documentation. We also moved the Update Log section to MacBlog, so the old More Tab only has settings left, so we just renamed it to Settings for more clear naming ⚙️!",
    "sh11": "What Does the Future of MacVG Hold?",
    "p11": "As I said earlier, we're focusing on the quality, features, and functionality of MacVG first, and after all features are at their bests, we'll roll out more and more unblocked free games and become one of the best, biggest, and popular online gaming platforms in the world 🌎!"
  },
  "others": {
    "count": "8",
    "other1": "New animation affects on search.",
    "other2": "Added 10 new sounds to MacBoard.",
    "other3": "Fixed Favorites not working, catagory navigational problems, and cloaker problems.",
    "other4": "Minor visual appearance changes and updates.",
    "other5": "Updated different catagories because of new games and removal of old games.",
    "other6": "Removed 10 games for not working, maintainance, crashing issues, including Escaping the Prison, Shellshockers, Starve.io, Ballistic Chickens, Suviv, Zombs Royale, Jack Smith, Google Snake, Double Wires, and Chrome Dino. (Believe me, they're the only problemetic games that wasn't took care of for a really long time, so we finally got rid of them in the 2.0 update!) ",
    "other7": "Redid file organization and other file management for simpler and more clear code.",
    "other8": "Removed the Portfolio link at the footer."
  },
  "menulinks": {
    "count": "13",
    "menu1": "Intro",
    "menu1link": "#home",
    "menu2": "New Game Page Layout",
    "menu2link": "#sh1",
    "menu3": "New Tab: New",
    "menu3link": "#sh2",
    "menu4": "New Tab: Trending",
    "menu4link": "#sh3",
    "menu5": "New Tab: Chat",
    "menu5link": "#sh4",
    "menu6": "New Tab: Groups",
    "menu6link": "#sh5",
    "menu7": "New Tab: MacBoard",
    "menu7link": "#sh6",
    "menu8": "New Feature: Themes",
    "menu8link": "#sh7",
    "menu9": "New Menu",
    "menu9link": "#sh8",
    "menu10": "8 New Games",
    "menu10link": "#sh9",
    "menu11": "Renamed Settings",
    "menu11link": "#sh10",
    "menu12": "Future of MacVG",
    "menu12link": "#sh11",
    "menu13": "Others",
    "menu13link": "#otherslist"
  },
  "year": "2024"
}
