{
  "title": "MacVG Version 2.10 July Update",
  "date": "7.1.2024",
  "description": "July is the month of summer! Most of you are probably already out of school in summer break, and you should be spending time with your family outside touching grass instead of being indoors playing unblocked games. Seriously, get off the game site. But anyways, we're still publishing our monthly updates, so here's what this relatively small stabilization update is about, from new games to bug fixes and more:",
  "mainarticles": {
    "count": "3",
    "sh1": "30 NEW GAMES!",
    "p1": "This is the most games we've ever added in a single update since the initial release of MacVG with about 250 games more than a year ago. We spent a lot of time adding these new games, optimizing them, and putting them onto MacVG, so please go to the New Tab and check them out, maybe you'll find your favorite games there! From sports and idle games to adventure and reactions games, there's a ton of new fun waiting for you 🔥!",
    "sh2": "CONTENT IMPROVEMENTS",
    "p2": "Because of the new games added, we updated the content on many pages and updated some features because of this. We also reorganized MacVG's files into simple folders and cleaned-up, decluttered, merged, and optimized many execution and page files, along with updating some content and deleting unnecessary files, for a smoother, faster, and cleaner experience when using MacVG 🧹.",
    "sh3": "BUG FIXES",
    "p3": "We fixed a lot of bugs in this update. From minor bugs to major bugs that made several games unplayable, they're all fixed in this update! The most important bug fix in this update is making it possible to type and interact in some games! A lot of you have mentioned this bug of not being able to type in many games, thus affecting game play, and we finally fixed it! A ton of the games are now playable because of this fix, so go check them out! We also fixed some bugs on the cloaker, Side Search, page content, layouts, and some other small appearance issues. Enjoy the bugless game site 🛠️!"
  },
  "others": {
    "count": "9",
    "other1": "Made a lot of games playable by fixing a couple major bugs. (yay!)",
    "other2": "Renamed a few games and updated some thumbnails.",
    "other3": "Updated Shoology cloaker favicon.",
    "other4": "Updated game description content.",
    "other5": "Fixed announcement showing on the Originals Tab.",
    "other6": "Fixed favicon not showing on game pages when using Chrome.",
    "other7": "Fixed Side Search not working when there's no Recent games.",
    "other8": "Fixed iframe game layout on some games.",
    "other9": "Minor appearance updates.",
    "other10": "Removed info.css and info implementations in all game.html files.",
    "other11": "Removed MacVG User Survey."
  },
  "menulinks": {
    "count": "5",
    "menu1": "Intro",
    "menu1link": "#home",
    "menu2": "30 New Games",
    "menu2link": "#sh1",
    "menu3": "Content Changes",
    "menu3link": "#sh2",
    "menu4": "Bug Fixes",
    "menu4link": "#sh3",
    "menu5": "Others",
    "menu5link": "#otherslist"
  },
  "year": "2024"
}
