{
  "title": "MacVG Version 2.9 June Update",
  "date": "6.1.2024",
  "description": "Are you guys ready for summer break? Good news: it's only less than a month away! MacVG is also getting its own break with a bunch of bug fixes and stablization changes. After all the crazy updates, features, games, and reworks from the previous months, this update is more of a improvements update. We fixed a lof of bugs, issues, and glitched games, updated a lot of content, and improved our games' optimizations and performance with less lag and glitches. Here are the release notes for this update:",
  "mainarticles": {
    "count": "4",
    "sh1": "10 NEW GAMES",
    "p1": "We've been reading everyone's feedbacks and game requests, and almost everyone wants more new games. That's why we added 10 new fun games in this update that we hope you'll enjoy! Simply go the the New tab and check out the new games added in this update. Maybe you'll find your new favorite game there after playing them 🕹️!",
    "sh2": "NEW FEATURE: Side Search!",
    "p2": "In this update, we finally got rid of the weird games listed on the right side of each game page! They were problematic because they're pretty useless, there isn't a lot of games there, and they slowed down the loading time of the game. Instead, you'll see a new search bar on the right of each game page that lets you search any game on MacVG just like you would on the home page. This search bar makes navigating between games way easier and faster. To get from a game to another game, you no longer need to go back to the home page, search for the game, and click on it. Instead, you can just search up the game from the game page, and start playing instantly 🔎!",
    "sh3": "CONTENT IMPROVEMENTS",
    "p3": "With last month's appearance updates, there were some broken thumbnails and styling for the games, so we added some new thumbnails and styling improvements. We also updated the content in each catagory and added a new group in the Groups tab because of new games. We also added a bunch more game descriptions and information on several games. There are also a couple new additions on MacBoard. We reorganized and cleaned up some files. On top of all these changes, we also improved our code efficiency and enchanced our game optimizations, meaning there will be less lag now 🔥!",
    "sh4": "BUG FIXES",
    "p4": "To keep your gaming experience seamless and smooth, we fixed a bunch of bugs, old and new. We fixed the MacBoard navigation issue, fixed new animation not showing on some games when hovering, slight improvements on Custom Theme, fixed tiny styling issues, fixed update announcement covering the page title, and updated the site's styling. We also fixed the long lasted issues of not being able to play We Become What We Behold properly and Cut the Rope games not being displayed in the new game page UI, which means you can now favorite, share, report, and play Cut the Rope in full screen and see the related information on the games 🐛!"
  },
  "others": {
    "count": "7",
    "other1": "New slogan on the home page.",
    "other2": "New scrollbar appearance.",
    "other3": "Improved data analytics.",
    "other4": "Minor appearance updates.",
    "other5": "Minor bug patches.",
    "other6": "Removed the Similar Games section on some games.",
    "other7": "Added a new button in the about:blank section in Settings to open MacVG in about:blank quicker."
  },
  "menulinks": {
    "count": "6",
    "menu1": "Intro",
    "menu1link": "#home",
    "menu2": "10 New Games",
    "menu2link": "#sh1",
    "menu3": "Side Search",
    "menu3link": "#sh2",
    "menu4": "Content Changes",
    "menu4link": "#sh3",
    "menu5": "Bug Fixes",
    "menu5link": "#sh4",
    "menu6": "Others",
    "menu6link": "#otherslist"
  },
  "year": "2024"
}
