{
  "title": "MacVG Version 2.2 March Update",
  "date": "3.1.2024",
  "description": "This month, we focused on massively updating MacLearn and MacTime, without spending too much time working on MacVG, as it's already pretty good. One massive change is the new colors and a more sleek appearance throughout the whole user interface, other than that and some minor changes and bug fixes, there isn't anything too big. This update is more like a small maintainance update that enhances the site just a little bit. So let's see what's new with this update.",
  "mainarticles": {
    "count": "2",
    "sh1": "NEW APPEARANCE",
    "p1": "This major change includes two reworks: primary color and general design. MacVG originally had dark blue for logo color, gold for accent color, random colors in random places, and neutral colors for background and elements. In this change, we unified the logo color and the accent color into this brand new vibrant orange color that guides you through the website. This makes your experience more unified, modern, and it's easier to distinguish between different MacWeb apps as they all got their own colors. Orange also asociates with excitement, fun, and vibrancy, which reflects what MacVG does: providing fun and exciting entertainment for you. We also changed element appearance including remade input fields that look more polished and more modern buttons. These design changes help with your experience and your eyes, making your game time at MacVG more comfortable 🎨.",
    "sh2": "NEW THEME: Deep Dark!",
    "p2": "We already had dark and light modes for you to choose from, but that's not enough. In this update, we're rolling out Deep Dark Mode that you can select from the Settings tab that makes everything pure black. This change helps a lot when it comes to eye comfort and low light environments. This also made MacVG a more accessible place for everyone to enjoy. Deep Dark also adds a unique touch that hopefully you'll like, enjoy 🔥!"
  },
  "others": {
    "count": "6",
    "other1": "Fixed panic button and cloaker bugs and problems.",
    "other2": "Fixed light mode problems and bugs and made it more polished.",
    "other3": "Added new links and removed broken links from the navigational pane on the top right corner of game pages due to new pages and page removals.",
    "other4": "Removed combination panic buttons because of inefficiency and bugs.",
    "other5": "Removed some appearance bugs and animations.",
    "other6": "Removed the back button from the tool bar because it's ... useless."
  },
  "menulinks": {
    "count": "4",
    "menu1": "Intro",
    "menu1link": "#home",
    "menu2": "New Appearance",
    "menu2link": "#sh1",
    "menu3": "Deep Dark Theme",
    "menu3link": "#sh2",
    "menu4": "Others",
    "menu4link": "#otherslist"
  },
  "year": "2024"
}
