{
  "title": "MacVG Version 2.7 May Update",
  "date": "5.1.2024",
  "description": "As the weather's becoming warmer and the summer break's coming closer, we released a bunch of new features, fixes, and most importantly, new games, to MacVG, as we haven't added any game for a pretty long time now. Hope you enjoy this update, and let's see what's new:",
  "mainarticles": {
    "count": "4",
    "sh1": "12 NEW GAMES",
    "p1": "After the big update we released almost 5 months ago, we haven't released any new game, so we're starting to add more and more new games on each update to keep your experience on MacVG fresh and exiciting. In this update, we added 12 new popular games that you'll enjoy playing. You can check out all the new games in the New tab of MacVG! We also updated the content on each tab because of new games and some minor adjustments 🕹️.",
    "sh2": "NEW LOOKS",
    "p2": "Following the release of MacWeb site material 3, we added responsive designs and features to all our apps, including MacVG, because a lot of people have been complaining about website not working when using a phone, a smaller screen, or when zooming in. With this improvement, MacVG will automatically adjust its content to fit the screen size perfectly without not being able to use some features or links. This change made it easier for people to access the website and enjoy the same experience. We also updated the hover animation of games to match the site material 👍.",
    "sh3": "MACBOARD REWORK",
    "p3": "We barely updated MacBoard since the release of it, which was more than half a year ago, and it had a lot of things that need to be updated and fixed. Other than changing the appearance of it, we also added a bunch of new features, like Repeat Sound, Download Sound, and Favorite Sound. These buttons will show when you hover over a sound. These features make it easy to have fun with the sounds while having maximum control over them! To stop repeating a sound, simply click on Stop All at the top of the page. We also improved the search functionality, random sound button, and other features. You can now play with the sounds with ways never seen before. On top of all that, we also added more than 20 new sounds from users' requests. Enjoy the new soundboard 🗣️🔥!",
    "sh4": "BUG FIXES",
    "p4": "We fixed a lot of bugs caused by previous updates to keep your experience seamless and smooth. We patched the bug of Favorite and full screen not working on downloadable games, Download 2.0 not working, overflowing menu showing, custom theme not working on MacBoard, glowing not working on MacBoard, and fixed the bug caused by some styling issues. With these bugs patched, your gaming time on MacVG will be better than ever 🪲!"
  },
  "others": {
    "count": "8",
    "other1": "Added Remove Favorites button to remove all Favorited games at once.",
    "other2": "Delayed the release of Cosmic Clicker to August. (🙁)",
    "other3": "The update announcement banner is now only on the homepage.",
    "other4": "Minor appearance updates.",
    "other5": "Removed some appearance bugs and animations.",
    "other6": "New descriptions and information on several games.",
    "other7": "Removed the Similar Games section on some games.",
    "other8": "Removed 2 games, Monkey Mart and Run 3, due to very strage glitches and crashes."
  },
  "menulinks": {
    "count": "6",
    "menu1": "Intro",
    "menu1link": "#home",
    "menu2": "12 New Games",
    "menu2link": "#sh1",
    "menu3": "New Looks",
    "menu3link": "#sh2",
    "menu4": "MacBoard Rework",
    "menu4link": "#sh3",
    "menu5": "Bug Fixes",
    "menu5link": "#sh4",
    "menu6": "Others",
    "menu6link": "#otherslist"
  },
  "year": "2024"
}
