{
  "title": "MacWeb Site Material 2",
  "date": "1.19.2024",
  "description": "Before this important appearance update, MacWeb is still a chaotic new born app and each app looks and works differently from each other. The appearance was also not up to date and not very functional, that's why we poured hours of work into redesigning and reimagining the entire MacWeb, making Site Material 2. Let's see what's new here:",
  "mainarticles": {
    "count": "4",
    "sh1": "ROLLING OUT NOW!",
    "p1": "Updates of the MacWeb Site Material 2 appearance have been rolling out since November, but today, all of MacWeb's apps, pages, and every single place of MacWeb finished updating to Site Material 2!",
    "sh2": "NEW VERTICLE SIDEBAR!",
    "p2": "New vertical sidebar on the left of each page of each MacWeb app that navigates you through different MacWeb apps, and it only appears when the user's cursor hits the left edge of the screen, and if you click anywhere else, the sidebar's gonna hide away again, to save more space to focus, while also having the convenience of navigating between different apps!",
    "sh3": "NEW EFFECTS!",
    "p3": "New hovering effect when hovering over different tabs within a MacWeb app, for more modern and appealing effects and user experience!",
    "sh4": "NEW LOGOS!",
    "p4": "New logos for each MacWeb app that look more distinct, clearn, modern, and easy to recgonize! We also applied the new logos to the logo at the top left of the horizontal navigational bar to make the app more unified and visually appealing!"
  },
  "others": {
    "count": "2",
    "other1": "Minor appearance updates.",
    "other2": "Minor navigational updates.",
    "other3": "Reorganized files and content for a faster and seamless experience."
  },
  "menulinks": {
    "count": "6",
    "menu1": "Intro",
    "menu1link": "#home",
    "menu2": "Rolling Out Now",
    "menu2link": "#sh1",
    "menu3": "New Sidebar",
    "menu3link": "#sh2",
    "menu4": "New Effects",
    "menu4link": "#sh3",
    "menu5": "New Logos",
    "menu5link": "#sh4",
    "menu6": "Others",
    "menu6link": "#otherslist"
  },
  "year": "2024"
}
